app/controllers/apis_controller.rb

  def rescue_latest_tweets
    if Tweet.all

      @retweets = Retweet.group(:tweet_id).order('created_at DESC')
      tweets=[]
      @tweets=Tweet.all.order('created_at DESC').limit(50)

      @tweets.each do |tweet|
        tweets << { id: tweet.id, content: tweet.content,user_id: tweet.user_id, likes_count: tweet.likes_count,retweets_count: tweet.retweets_count,rewtitted_from: @retweets.map{|retweet|tweet.id == retweet.tweet_id ? retweet.user_id : ""}.select{|v|v!=""}.to_s.tr('[]', '').to_i}
---
SELECT "retweets".* FROM "retweets" GROUP BY "retweets"."tweet_id" ORDER BY created_at DESC
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 50]]

  def rescue_last_dates
    @retweets=Retweet.group(:tweet_id).order('created_at DESC')
    @from=params[:from]
    @to_date=params[:to]
    @tweets=Tweet.where(created_at:@from.. @to_date)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."created_at" BETWEEN ? AND ?  [["created_at", "2020-09-14 00:00:00"], ["created_at", "2020-09-15 00:00:00"]]

  def tweet_with_postman
    if !current_user
      render json: {status: "error", code: 3000, message: "You aren't log in"}
      else
      @tweet=Tweet.new(tweet_params)
      @tweet.user_id=current_user.id

      if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hola, soy un tweet hecho con POSTMAN"], ["user_id", 11], ["created_at", "2020-09-15 19:47:17.951081"], ["updated_at", "2020-09-15 19:47:17.951081"]]