app/controllers/likes_controller.rb

  def create
    tweet =Tweet.find_by(id:params[:format])
    if Like.find_by(user_id:current_user.id,tweet_id:tweet.id )
      @destruir= Like.find_by(user_id:current_user.id,tweet_id:tweet.id)
      @destruir.destroy
      tweet.likes_count-=1
      tweet.save
      redirect_to root_path
    else
      Like.create(user_id:current_user.id, tweet_id:tweet.id)
      tweet.likes_count+=1
      tweet.save
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["user_id", 11], ["tweet_id", 15], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["user_id", 10], ["tweet_id", 15], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 4]]
UPDATE "tweets" SET "likes_count" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["likes_count", 2], ["updated_at", "2020-09-14 20:40:53.687431"], ["id", 15]]
INSERT INTO "likes" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 11], ["tweet_id", 15], ["created_at", "2020-09-14 19:41:05.344221"], ["updated_at", "2020-09-14 19:41:05.344221"]]
UPDATE "tweets" SET "likes_count" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["likes_count", 1], ["updated_at", "2020-09-14 19:41:05.441859"], ["id", 15]]