app/controllers/retweets_controller.rb

  def create
    tweet=Tweet.find_by(id:params[:format])
    if Retweet.find_by(user_id:current_user.id,tweet_id:tweet.id )
      @destruir= Retweet.find_by(user_id:current_user.id,tweet_id:tweet.id)
      @destruir.destroy
      tweet.retweets_count-=1
      tweet.save
      redirect_to root_path
    else
      Retweet.create(user_id:current_user.id, tweet_id:tweet.id)
      tweet.retweets_count+=1
      tweet.save
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "retweets".* FROM "retweets" WHERE "retweets"."user_id" = ? AND "retweets"."tweet_id" = ? LIMIT ?  [["user_id", 11], ["tweet_id", 15], ["LIMIT", 1]]
DELETE FROM "retweets" WHERE "retweets"."id" = ?  [["id", 1]]
UPDATE "tweets" SET "retweets_count" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["retweets_count", 1], ["updated_at", "2020-09-14 20:40:37.700900"], ["id", 20]]
INSERT INTO "retweets" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 11], ["tweet_id", 15], ["created_at", "2020-09-14 19:55:06.874749"], ["updated_at", "2020-09-14 19:55:06.874749"]]
UPDATE "tweets" SET "retweets_count" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["retweets_count", 1], ["updated_at", "2020-09-14 20:06:18.661849"], ["id", 16]]