app/controllers/tweets_controller.rb

  def index

    if !current_user

      @q=Tweet.ransack(params[:q])
      @tweets=@q.result.order('created_at DESC').page params[:page]
      @retweets=Retweet.all

    else
      @q=Tweet.tweets_for_me(current_user.followings.pluck(:id)).ransack(params[:q])
      @tweets=@q.result.order('created_at DESC').page params[:page]
---
SELECT "tweets".* FROM "tweets" WHERE 1=0 ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 50], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tweets"
SELECT "retweets".* FROM "retweets"
SELECT "tweets".* FROM "tweets"
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["user_id", 11], ["LIMIT", 50], ["OFFSET", 0]]

  def show
    @likes = Like.all
---
SELECT "likes".* FROM "likes"

  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user = current_user
    if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Deleniti excepturi n"], ["user_id", 2], ["created_at", "2020-08-30 00:50:56.482751"], ["updated_at", "2020-08-30 00:50:56.482751"]]

    def set_current_tweet
      @tweet = Tweet.find(params[:tweet_id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]